Revit 2027 API
ParameterTypeId.RbsEnergyAnalysisMode Property
 "Mode"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsEnergyAnalysisMode { get; }
Public Shared ReadOnly Property RbsEnergyAnalysisMode As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsEnergyAnalysisMode {
	ForgeTypeId^ get ();
}
static member RbsEnergyAnalysisMode : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace